bench/scale_fio/fio_logs/ext4/randread_128k_2.log
randread: (g=0): rw=randread, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=psync, iodepth=1
...
fio-3.16
Starting 2 processes

randread: (groupid=0, jobs=2): err= 0: pid=243576: Thu Oct  9 16:37:28 2025
  read: IOPS=12.1k, BW=1510MiB/s (1584MB/s)(2048MiB/1356msec)
    clat (usec): min=6, max=2744, avg=158.47, stdev=108.03
     lat (usec): min=6, max=2744, avg=158.54, stdev=108.04
    clat percentiles (usec):
     |  1.00th=[   12],  5.00th=[   22], 10.00th=[   26], 20.00th=[   35],
     | 30.00th=[   40], 40.00th=[  178], 50.00th=[  202], 60.00th=[  221],
     | 70.00th=[  237], 80.00th=[  251], 90.00th=[  265], 95.00th=[  277],
     | 99.00th=[  306], 99.50th=[  314], 99.90th=[  355], 99.95th=[ 1303],
     | 99.99th=[ 2737]
   bw (  MiB/s): min= 1134, max= 1618, per=91.12%, avg=1376.25, stdev=141.59, samples=4
   iops        : min= 9076, max=12944, avg=11010.00, stdev=1132.73, samples=4
  lat (usec)   : 10=0.40%, 20=2.77%, 50=33.48%, 100=0.49%, 250=42.54%
  lat (usec)   : 500=20.25%
  lat (msec)   : 2=0.05%, 4=0.01%
  cpu          : usr=1.23%, sys=40.56%, ctx=10298, majf=0, minf=85
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=16384,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=1510MiB/s (1584MB/s), 1510MiB/s-1510MiB/s (1584MB/s-1584MB/s), io=2048MiB (2147MB), run=1356-1356msec

Disk stats (read/write):
  nvme1n1: ios=9024/0, merge=0/0, ticks=1375/0, in_queue=1376, util=92.28%