bench/scale_fio/fio_logs/ext4/randread_128k_32.log
randread: (g=0): rw=randread, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=psync, iodepth=1
...
fio-3.16
Starting 32 processes

randread: (groupid=0, jobs=32): err= 0: pid=244432: Thu Oct  9 16:37:49 2025
  read: IOPS=28.3k, BW=3535MiB/s (3707MB/s)(32.0GiB/9269msec)
    clat (usec): min=8, max=5935, avg=991.57, stdev=1101.00
     lat (usec): min=8, max=5935, avg=991.75, stdev=1101.01
    clat percentiles (usec):
     |  1.00th=[   26],  5.00th=[   32], 10.00th=[   43], 20.00th=[   53],
     | 30.00th=[   65], 40.00th=[  314], 50.00th=[  457], 60.00th=[  906],
     | 70.00th=[ 1516], 80.00th=[ 2089], 90.00th=[ 2606], 95.00th=[ 2900],
     | 99.00th=[ 4359], 99.50th=[ 4686], 99.90th=[ 5211], 99.95th=[ 5407],
     | 99.99th=[ 5669]
   bw (  MiB/s): min= 2888, max= 6731, per=100.00%, avg=4449.76, stdev=33.45, samples=505
   iops        : min=23106, max=53841, avg=35587.01, stdev=267.48, samples=505
  lat (usec)   : 10=0.02%, 20=0.56%, 50=16.76%, 100=19.27%, 250=0.59%
  lat (usec)   : 500=14.63%, 750=5.60%, 1000=4.17%
  lat (msec)   : 2=16.77%, 4=19.91%, 10=1.74%
  cpu          : usr=0.30%, sys=9.77%, ctx=165996, majf=0, minf=1337
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=262144,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=3535MiB/s (3707MB/s), 3535MiB/s-3535MiB/s (3707MB/s-3707MB/s), io=32.0GiB (34.4GB), run=9269-9269msec

Disk stats (read/write):
  nvme1n1: ios=163920/0, merge=0/0, ticks=233821/0, in_queue=233821, util=98.92%