bench/scale_fio/fio_logs/ext4/randread_4k_16.log
randread: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
...
fio-3.16
Starting 16 processes

randread: (groupid=0, jobs=16): err= 0: pid=240930: Thu Oct  9 16:36:59 2025
  read: IOPS=232k, BW=907MiB/s (951MB/s)(16.0GiB/18072msec)
    clat (nsec): min=424, max=5702.1k, avg=65641.16, stdev=54074.78
     lat (nsec): min=438, max=5702.3k, avg=65766.90, stdev=54082.26
    clat percentiles (nsec):
     |  1.00th=[  1912],  5.00th=[  2224], 10.00th=[  2512], 20.00th=[  3088],
     | 30.00th=[  4128], 40.00th=[ 71168], 50.00th=[ 78336], 60.00th=[ 86528],
     | 70.00th=[ 92672], 80.00th=[104960], 90.00th=[129536], 95.00th=[150528],
     | 99.00th=[201728], 99.50th=[224256], 99.90th=[272384], 99.95th=[292864],
     | 99.99th=[350208]
   bw (  KiB/s): min=616353, max=1570432, per=100.00%, avg=949904.91, stdev=16555.63, samples=549
   iops        : min=154088, max=392608, avg=237476.08, stdev=4138.91, samples=549
  lat (nsec)   : 500=0.01%, 750=0.02%, 1000=0.07%
  lat (usec)   : 2=1.56%, 4=27.46%, 10=6.88%, 20=0.77%, 50=0.03%
  lat (usec)   : 100=39.97%, 250=23.02%, 500=0.21%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%
  cpu          : usr=3.26%, sys=17.78%, ctx=2652058, majf=0, minf=173
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=4194304,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=907MiB/s (951MB/s), 907MiB/s-907MiB/s (951MB/s-951MB/s), io=16.0GiB (17.2GB), run=18072-18072msec

Disk stats (read/write):
  nvme1n1: ios=2647399/0, merge=0/0, ticks=229327/0, in_queue=229326, util=99.49%