bench/scale_fio/fio_logs/ext4/randwrite_128k_8.log
randwrite: (g=0): rw=randwrite, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=psync, iodepth=1
...
fio-3.16
Starting 8 processes

randwrite: (groupid=0, jobs=8): err= 0: pid=253709: Thu Oct  9 16:40:32 2025
  write: IOPS=7018, BW=877MiB/s (920MB/s)(8192MiB/9337msec); 0 zone resets
    clat (usec): min=5, max=64506, avg=111.01, stdev=1616.23
     lat (usec): min=5, max=64507, avg=111.85, stdev=1616.30
    clat percentiles (usec):
     |  1.00th=[   16],  5.00th=[   22], 10.00th=[   24], 20.00th=[   28],
     | 30.00th=[   32], 40.00th=[   36], 50.00th=[   38], 60.00th=[   40],
     | 70.00th=[   42], 80.00th=[   45], 90.00th=[   58], 95.00th=[  111],
     | 99.00th=[  163], 99.50th=[  231], 99.90th=[35914], 99.95th=[41157],
     | 99.99th=[56361]
   bw (  MiB/s): min=11569, max=13996, per=100.00%, avg=12783.03, stdev=415.13, samples=10
   iops        : min=92552, max=111971, avg=102261.50, stdev=3320.95, samples=10
  lat (usec)   : 10=0.05%, 20=3.57%, 50=81.93%, 100=8.75%, 250=5.28%
  lat (usec)   : 500=0.08%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.05%, 4=0.06%, 10=0.05%, 20=0.01%, 50=0.15%
  lat (msec)   : 100=0.02%
  cpu          : usr=0.07%, sys=5.51%, ctx=5475, majf=0, minf=82
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,65536,0,8 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=877MiB/s (920MB/s), 877MiB/s-877MiB/s (920MB/s-920MB/s), io=8192MiB (8590MB), run=9337-9337msec

Disk stats (read/write):
  nvme1n1: ios=1583/19843, merge=0/12555, ticks=417/2690370, in_queue=2690969, util=99.06%