bench/scale_fio/fio_logs/ext4/randwrite_4k_16.log
randwrite: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
...
fio-3.16
Starting 16 processes

randwrite: (groupid=0, jobs=16): err= 0: pid=249107: Thu Oct  9 16:39:22 2025
  write: IOPS=190k, BW=743MiB/s (779MB/s)(16.0GiB/22056msec); 0 zone resets
    clat (nsec): min=267, max=54462k, avg=42054.29, stdev=1100620.77
     lat (nsec): min=287, max=54462k, avg=42107.08, stdev=1100621.08
    clat percentiles (nsec):
     |  1.00th=[     820],  5.00th=[    1012], 10.00th=[    1160],
     | 20.00th=[    1432], 30.00th=[    1736], 40.00th=[    2096],
     | 50.00th=[    2512], 60.00th=[    2928], 70.00th=[    3472],
     | 80.00th=[    4256], 90.00th=[    6112], 95.00th=[   10048],
     | 99.00th=[   13760], 99.50th=[   15552], 99.90th=[28180480],
     | 99.95th=[31064064], 99.99th=[36438016]
   bw (  MiB/s): min=  763, max=11743, per=100.00%, avg=1541.30, stdev=148.78, samples=348
   iops        : min=195436, max=3006350, avg=394571.74, stdev=38088.18, samples=348
  lat (nsec)   : 500=0.02%, 750=0.39%, 1000=4.27%
  lat (usec)   : 2=33.04%, 4=39.69%, 10=17.57%, 20=4.78%, 50=0.11%
  lat (usec)   : 100=0.01%, 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 10=0.01%, 50=0.13%, 100=0.01%
  cpu          : usr=0.53%, sys=8.56%, ctx=226945, majf=0, minf=200
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,4194304,0,16 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=743MiB/s (779MB/s), 743MiB/s-743MiB/s (779MB/s-779MB/s), io=16.0GiB (17.2GB), run=22056-22056msec

Disk stats (read/write):
  nvme1n1: ios=257/1540539, merge=0/50749, ticks=51/7629013, in_queue=7629435, util=98.84%